''' 
Створити функцію get_days_from_today(date), яка розраховує 
кількість днів між заданою датою та поточною датою. Для обробки винятків 
застосуємо конструкцію try/except
'''

from datetime import datetime
def get_days_from_today(date: str) -> int:
    """ 
    Функція get_days_from_today(date) обчислює 
    кількість днів між поточною датою та введеною датою.

    Аргумент: date: str - рядок дати у форматі 'РРРР-ММ-ДД'.

    Функція повертає ціле число int - кількість днів між поточною і введеною датою.
    Якщо обчислюємо дату у майбутньому - результатом буде від'ємне число.

    Для обробки винятків застосуємо конструкцію try/except.
    Якщо формат введення некоректний - результатом буде виведено 
    повідомлення і значення None.
    """
    try:
      # перетворимо рядок дати у форматі 'РРРР-ММ-ДД' у об'єкт datetime
        input_date = datetime.strptime(date, "%Y-%m-%d").date()
      # визначимо поточну дату, використовуючи datetime.today()
        current_date = datetime.today().date()
      # обчислимо різницю між поточною датою та заданою датою
        delta = current_date - input_date
      # повернемо різницю у днях як ціле число, використовуючи атрибут .days
        return delta.days
    except ValueError:
        print("Помилка: Введіть дату у форматі 'РРРР-ММ-ДД'.")
        return None


print(get_days_from_today("2025-11-24"))
print(get_days_from_today("2025/11/24"))
