"""
Щоб виграти головний приз лотереї, необхідний збіг кількох номерів 
на лотерейному квитку з числами, що випали випадковим чином і в певному 
діапазоні під час чергового тиражу. Наприклад, необхідно вгадати шість 
чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
"""
import random
def get_numbers_ticket(min_num, max_num, quantity):
    """
    Функція get_numbers_ticket(min_num, max_num, quantity) генерує список 
    випдкових чисел для лотерейного квитка.
    
    Аргументи: 
    min_num (int) - мінімальне можливе число у наборі (не менше 1);
    max_num (int) - максимальне можливе число у наборі (не більше 1000);
    quantity (int) - кількість чисел, які потрібно вибрати (значення між min і max).

    Функція повертає відсортований список унікальних випадкових чисел 
    у заданому діапазоні або порожній список при некоректних параметрах.    
    """
    # перевіримо валідність вхідних даних
    if not (1 <= min_num < max_num <= 1000):
        return []
    if not (1 <= quantity <= (max_num - min_num + 1)):
        return []

    # згенеруємо унікальні випадкові числа за допомогою функції .sample() модуля random
    unique_nums = random.sample(range(min_num, max_num + 1), quantity)
    # відсортуємо список чисел за допомогою методу .sort()
    unique_nums.sort()
    return unique_nums

lottery_numbers = get_numbers_ticket(1, 49, 6)
print("Ваші лотерейні числа:", lottery_numbers)
